{
    "titleNameMap": {
        "educationList": "Education Background",
        "workExpList": "Work Experience",
        "projectList": "Project Experience",
        "skillList": "Personal Skills",
        "awardList": "Awards",
        "workList": "Personal Works",
        "aboutme": "About Me"
    },
    "avatar": {
        "src": "https://avatars.githubusercontent.com/u/83796250?v=4",
        "hidden": false
    },
    "profile": {
        "name": "李岱耕 Daigeng Li",
        "email": "Jemtaly@outlook.com",
        "mobile": "15318722412",
        "github": "https://github.com/Jemtaly",
        "zhihu": "",
        "workExpYear": ""
    },
    "educationList": [
        {
            "edu_time": [
                "2020.09.01",
                "2024.06.30"
            ],
            "school": "Shandong University",
            "major": "Information Security",
            "academic_degree": "Bachelor",
            "dataIndex": 0
        }
    ],
    "awardList": [
        {
            "award_time": "2022",
            "award_info": "Shandong University Geek Out CTF 2023 - 2nd Place",
            "dataIndex": 0
        },
        {
            "award_time": "2023",
            "award_info": "HWS CTF 2023 Winter Camp - 9th Place",
            "dataIndex": 1
        }
    ],
    "workExpList": [],
    "skillList": [
        {
            "skill_name": "College Courses",
            "skill_level": 100,
            "skill_desc": "Learned and mastered the basic knowledge of linear algebra, abstract algebra, discrete mathematics, graph theory and combinatorics, number theory and probability theory during university. Have the professional knowledge of cryptography, data structure and algorithm, computer composition principle, compiler principle and reverse engineering, operating system principle and computer network.",
            "dataIndex": 0
        },
        {
            "skill_name": "C++",
            "skill_level": 100,
            "skill_desc": "Through learning and practice, I have a deep understanding of the core syntax features of C and C++11/14/17/20. Familiar with the usage of STL library. Have some personal project experience.",
            "dataIndex": 1
        },
        {
            "skill_name": "Python",
            "skill_level": 80,
            "skill_desc": "Have a deep understanding of various syntax features of Python. Can use common third-party libraries such as NumPy to implement some simple web crawler scripts. Can use PyQt for graphic development.",
            "dataIndex": 2
        },
        {
            "skill_name": "Other Programming Languages",
            "skill_level": 80,
            "skill_desc": "Also familiar with and can use a variety of programming languages including Verilog HDL (can implement basic CPU, cryptographic algorithms hardware optimizations, etc.), Rust, Lua, Lisp, Haskell, etc., and have a strong acceptance ability, can quickly learn and master new languages.",
            "dataIndex": 3
        },
        {
            "skill_name": "Linux",
            "skill_level": 60,
            "skill_desc": "Can use basic Linux commands and tools. Can use scripting languages such as bash to implement automated processing of tasks.",
            "dataIndex": 4
        },
        {
            "skill_name": "Language Skills",
            "skill_level": 100,
            "skill_desc": "English: CET-6 (519) / Japanese: Simple conversation, reading and writing",
            "dataIndex": 5
        }
    ],
    "projectList": [],
    "workList": [
        {
            "work_name": "CryptoXX",
            "work_desc": "An OOP cryptography library implemented in C++, which aims to simplify the use steps by using the object-oriented features of C++, modularize the cryptographic algorithm, and make different cryptographic algorithms have a unified interface, so as to improve the scalability and flexibility. Supports a variety of common and uncommon symmetric ciphers and hash algorithms. The algorithms are highly optimized, and the efficiency of some algorithms can exceed that of classic cryptographic libraries such as OpenSSL.",
            "visit_link": "https://github.com/Jemtaly/CryptoXX",
            "dataIndex": 0
        },
        {
            "work_name": "ProjectLambda",
            "work_desc": "An interpreter of functional programming language based on syntax tree. The syntax is based on untyped lambda calculus, implementing features such as anonymous functions, lazy evaluation, GC (based on reference counting) and tail call optimization.",
            "visit_link": "https://github.com/Jemtaly/ProjectLambda",
            "dataIndex": 1
        },
        {
            "work_name": "Tk3D",
            "work_desc": "A prototype 3D engine based on Python that can project 3D objects and supports basic operations such as camera movement and rotation.",
            "visit_link": "https://github.com/Jemtaly/Tk3D",
            "dataIndex": 2
        },
        {
            "work_name": "More...",
            "work_desc": "Other projects completed during university, including course practice, personal interest projects and utility tools to improve work efficiency.",
            "visit_link": "https://github.com/Jemtaly",
            "dataIndex": 3
        }
    ],
    "aboutme": {
        "aboutme_desc": "Have rich code experience, independently completed many medium and small projects mainly based on C, C++ and Python languages, and read the code of open source projects such as OpenSSL. Have a deep understanding of the core knowledge in the language.\n\n- Good code style, strong adaptability. Good at code refactoring and organizing redundant code, can effectively improve development efficiency. Have a good mathematical foundation and logical thinking ability. Have strong ability of data structure and algorithm design and optimization.\n\n- Have solid professional foundation in software development and cryptography related disciplines through the study during university. Understand the underlying principles of cryptography and various attack methods. CTF experience (Sandbox, MISC and Cryptography).\n\n- Good at using tools and scripts to reduce repetitive labor and improve work efficiency. Have the ability to implement automated work by writing scripts.\n\n- Have strong self-learning ability, adaptability, information retrieval ability and concentration. And good at coordinating and cooperating in the team."
    },
    "theme": {
        "color": "#2f5785",
        "tagColor": "#8bc34a"
    }
}
